CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_exti.h
/* EXTI_PRIVCFG */                                         
#define EXTI_PRIVCFG_PRIV0              BIT(0)                 /*!< privilege configuration from line 0 */
#define EXTI_PRIVCFG_PRIV1              BIT(1)                 /*!< privilege configuration from line 1 */
#define EXTI_PRIVCFG_PRIV2              BIT(2)                 /*!< privilege configuration from line 2 */
#define EXTI_PRIVCFG_PRIV3              BIT(3)                 /*!< privilege configuration from line 3 */
#define EXTI_PRIVCFG_PRIV4              BIT(4)                 /*!< privilege configuration from line 4 */
#define EXTI_PRIVCFG_PRIV5              BIT(5)                 /*!< privilege configuration from line 5 */
#define EXTI_PRIVCFG_PRIV6              BIT(6)                 /*!< privilege configuration from line 6 */
#define EXTI_PRIVCFG_PRIV7              BIT(7)                 /*!< privilege configuration from line 7 */
#define EXTI_PRIVCFG_PRIV8              BIT(8)                 /*!< privilege configuration from line 8 */
#define EXTI_PRIVCFG_PRIV9              BIT(9)                 /*!< privilege configuration from line 9 */
#define EXTI_PRIVCFG_PRIV10             BIT(10)                /*!< privilege configuration from line 10 */
#define EXTI_PRIVCFG_PRIV11             BIT(11)                /*!< privilege configuration from line 11 */
#define EXTI_PRIVCFG_PRIV12             BIT(12)                /*!< privilege configuration from line 12 */
#define EXTI_PRIVCFG_PRIV13             BIT(13)                /*!< privilege configuration from line 13 */
#define EXTI_PRIVCFG_PRIV14             BIT(14)                /*!< privilege configuration from line 14 */
#define EXTI_PRIVCFG_PRIV15             BIT(15)                /*!< privilege configuration from line 15 */
#define EXTI_PRIVCFG_PRIV16             BIT(16)                /*!< privilege configuration from line 16 */
#define EXTI_PRIVCFG_PRIV17             BIT(17)                /*!< privilege configuration from line 17 */
#define EXTI_PRIVCFG_PRIV18             BIT(18)                /*!< privilege configuration from line 18 */
#define EXTI_PRIVCFG_PRIV19             BIT(19)                /*!< privilege configuration from line 19 */
#define EXTI_PRIVCFG_PRIV20             BIT(20)                /*!< privilege configuration from line 20 */
#define EXTI_PRIVCFG_PRIV21             BIT(21)                /*!< privilege configuration from line 21 */
#define EXTI_PRIVCFG_PRIV22             BIT(22)                /*!< privilege configuration from line 22 */
#define EXTI_PRIVCFG_PRIV23             BIT(23)                /*!< privilege configuration from line 23 */
#define EXTI_PRIVCFG_PRIV24             BIT(24)                /*!< privilege configuration from line 24 */
#define EXTI_PRIVCFG_PRIV25             BIT(25)                /*!< privilege configuration from line 25 */
#define EXTI_PRIVCFG_PRIV26             BIT(26)                /*!< privilege configuration from line 26 */
#define EXTI_PRIVCFG_PRIV27             BIT(27)                /*!< privilege configuration from line 27 */
#define EXTI_PRIVCFG_PRIV28             BIT(28)                /*!< privilege configuration from line 28 */

/* EXTI_LOCK */
#define EXTI_LOCK_LOCK                  BIT(0)                 /*!< global security and privilege configuration lock */

/* constants definitions */
/* EXTI line number */
typedef enum
{
    EXTI_0      = BIT(0),                                      /*!< EXTI line 0 */
    EXTI_1      = BIT(1),                                      /*!< EXTI line 1 */
    EXTI_2      = BIT(2),                                      /*!< EXTI line 2 */
    EXTI_3      = BIT(3),                                      /*!< EXTI line 3 */
    EXTI_4      = BIT(4),                                      /*!< EXTI line 4 */
    EXTI_5      = BIT(5),                                      /*!< EXTI line 5 */
    EXTI_6      = BIT(6),                                      /*!< EXTI line 6 */
    EXTI_7      = BIT(7),                                      /*!< EXTI line 7 */
    EXTI_8      = BIT(8),                                      /*!< EXTI line 8 */
    EXTI_9      = BIT(9),                                      /*!< EXTI line 9 */
    EXTI_10     = BIT(10),                                     /*!< EXTI line 10 */
    EXTI_11     = BIT(11),                                     /*!< EXTI line 11 */
    EXTI_12     = BIT(12),                                     /*!< EXTI line 12 */
    EXTI_13     = BIT(13),                                     /*!< EXTI line 13 */
    EXTI_14     = BIT(14),                                     /*!< EXTI line 14 */
    EXTI_15     = BIT(15),                                     /*!< EXTI line 15 */
    EXTI_16     = BIT(16),                                     /*!< EXTI line 16 */
    EXTI_17     = BIT(17),                                     /*!< EXTI line 17 */
    EXTI_18     = BIT(18),                                     /*!< EXTI line 18 */
    EXTI_19     = BIT(19),                                     /*!< EXTI line 19 */
    EXTI_20     = BIT(20),                                     /*!< EXTI line 20 */    
    EXTI_21     = BIT(21),                                     /*!< EXTI line 21 */
    EXTI_22     = BIT(22),                                     /*!< EXTI line 22 */
    EXTI_23     = BIT(23),                                     /*!< EXTI line 23 */
    EXTI_24     = BIT(24),                                     /*!< EXTI line 24 */
    EXTI_25     = BIT(25),                                     /*!< EXTI line 25 */
    EXTI_26     = BIT(26),                                     /*!< EXTI line 26 */
    EXTI_27     = BIT(27),                                     /*!< EXTI line 27 */
    EXTI_28     = BIT(28),                                     /*!< EXTI line 28 */
}exti_line_enum;

/* external interrupt and event */
typedef enum
{
    EXTI_INTERRUPT   = 0,                                      /*!< EXTI interrupt mode */
    EXTI_EVENT                                                 /*!< EXTI event mode */
}exti_mode_enum;

/* interrupt trigger mode */
typedef enum
{ 
    EXTI_TRIG_RISING = 0,                                      /*!< EXTI rising edge trigger */
    EXTI_TRIG_FALLING,                                         /*!< EXTI falling edge trigger */
    EXTI_TRIG_BOTH,                                            /*!< EXTI rising and falling edge trigger */
    EXTI_TRIG_NONE                                             /*!< EXTI without rising edge or falling edge trigger */
}exti_trig_type_enum;

/* function declarations */
/* interrupt and event configuration functions */
/* deinitialize the EXTI, reset the value of all EXTI registers into initial values */
void exti_deinit(void);
/* initialize the EXTI, enable the configuration of EXTI initialize */
void exti_init(exti_line_enum linex, exti_mode_enum mode, exti_trig_type_enum trig_type);
/* enable the interrupts from EXTI line x */
void exti_interrupt_enable(exti_line_enum linex);
/* disable the interrupts from EXTI line x */
void exti_interrupt_disable(exti_line_enum linex);
/* enable the events from EXTI line x */
void exti_event_enable(exti_line_enum linex);
/* disable the events from EXTI line x */
void exti_event_disable(exti_line_enum linex);

/* security attribution and privileged access configuration functions */
/* enable the security attribution from EXTI line x */
void exti_security_enable(exti_line_enum linex);
/* disable the security attribution from EXTI line x */
void exti_security_disable(exti_line_enum linex);
/*  enable the privileged access from EXTI line x */
void exti_privilege_enable(exti_line_enum linex);
/* disable the privileged access from EXTI line x */
void exti_privilege_disable(exti_line_enum linex);
/* lock EXTI security attribution and privileged access configuration */
void exti_lock_enable(void);

/* interrupt and flag functions */
/* enable EXTI software interrupt event */
void exti_software_interrupt_enable(exti_line_enum linex);
/* disable EXTI software interrupt event */
void exti_software_interrupt_disable(exti_line_enum linex);
/* get EXTI line x pending flag */
FlagStatus exti_flag_get(exti_line_enum linex);
/* clear EXTI line x pending flag */
void exti_flag_clear(exti_line_enum linex);
/* get EXTI line x flag when the interrupt flag is set */
FlagStatus exti_interrupt_flag_get(exti_line_enum linex);
/* clear EXTI line x pending flag */
void exti_interrupt_flag_clear(exti_line_enum linex);

#endif /* GD32W51X_EXTI_H */
